#### Terraform Format and Style 🖌`success`


#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_process_monetary_transactions.null_resource.create_dummy_zip: Refreshing state... [id=2780447853697785494]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0babcf060b0778adf]
module.kms.aws_kms_key.aurora: Refreshing state... [id=23b4f63c-5b17-4983-9118-a36a4d887981]
module.iam.aws_iam_role.sftp_user_role: Refreshing state... [id=sftp_user_role]
module.dynamodb.aws_dynamodb_table.main: Refreshing state... [id=business_transactions_table]
module.iam.aws_iam_role.process_monetary_transactions_lambda_role: Refreshing state... [id=process_monetary_transactions_lambda_role]
module.s3.aws_s3_bucket.sftp_bucket: Refreshing state... [id=scrooge-bank-g3t3-sftp-bucket]
module.transfer_family.aws_transfer_server.sftp_server: Refreshing state... [id=s-e499062f4adc49968]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3.aws_s3_bucket.sftp_bucket has been deleted
  - resource "aws_s3_bucket" "sftp_bucket" {
      - arn                         = "arn:aws:s3:::scrooge-bank-g3t3-sftp-bucket" -> null
      - bucket                      = "scrooge-bank-g3t3-sftp-bucket" -> null
        id                          = "scrooge-bank-g3t3-sftp-bucket"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.s3.aws_s3_bucket.sftp_bucket will be created
  + resource "aws_s3_bucket" "sftp_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "scrooge-bank-g3t3-sftp-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @yijiyap, Action: `pull_request`*